app/controllers/items_controller.rb

  def index
    if params[:search_manufacturer].present? || params[:search_cateogyr].present?
      @items = Item.search(params[:search_manufacturer], params[:search_cateogyr] ).order("created_at DESC")
---
SELECT "items".* FROM "items"  WHERE (manufacturer like '%gg%')  ORDER BY created_at DESC

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("cateogyr", "created_at", "manufacturer", "name", "picture", "price", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["cateogyr", "ddd"], ["created_at", "2015-04-10 21:52:31.366425"], ["manufacturer", "ddddd"], ["name", "de"], ["picture", "mo"], ["price", 133], ["updated_at", "2015-04-10 21:52:31.366425"]]