app/controllers/order_items_controller.rb

SELECT "order_items".* FROM "order_items"  WHERE "order_items"."order_id" = ?  [["order_id", 1]]
SELECT  "orders".* FROM "orders"  WHERE "orders"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "orders" SET "subtotal" = ?, "updated_at" = ? WHERE "orders"."id" = 2  [["subtotal", 0.98], ["updated_at", "2015-04-09 15:23:32.309000"]]
UPDATE "products" SET "amount" = ?, "updated_at" = ? WHERE "products"."id" = 6  [["amount", 9], ["updated_at", "2015-04-11 15:15:03.505553"]]
INSERT INTO "order_items" ("created_at", "order_id", "product_id", "quantity", "total_price", "unit_price", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["created_at", "2015-04-09 15:23:29.553441"], ["order_id", 1], ["product_id", 1], ["quantity", 1], ["total_price", 0.49], ["unit_price", 0.49], ["updated_at", "2015-04-09 15:23:29.553441"]]
INSERT INTO "orders" ("created_at", "order_status_id", "subtotal", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-04-09 15:23:29.503403"], ["order_status_id", 1], ["subtotal", 0.49], ["updated_at", "2015-04-09 15:23:29.503403"]]
---
  def create
    @order = current_order
    @order_item = @order.order_items.new(order_item_params)
	product = Product.find(@order_item.product_id)
     stock  = product.amount - 1
	 product.update_attributes(amount: stock)
    @order.save

SELECT  "order_items".* FROM "order_items"  WHERE "order_items"."order_id" = ? AND "order_items"."id" = ? LIMIT 1  [["order_id", 2], ["id", 11]]
SELECT  "orders".* FROM "orders"  WHERE "orders"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "order_items" SET "quantity" = ?, "total_price" = ?, "updated_at" = ? WHERE "order_items"."id" = 11  [["quantity", 3], ["total_price", 1.47], ["updated_at", "2015-04-09 15:36:05.945868"]]
---
  def update
    @order = current_order
    @order_item = @order.order_items.find(params[:id])
    @order_item.update_attributes(order_item_params)

SELECT  "order_items".* FROM "order_items"  WHERE "order_items"."order_id" = ? AND "order_items"."id" = ? LIMIT 1  [["order_id", 2], ["id", 2]]
SELECT  "orders".* FROM "orders"  WHERE "orders"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "order_items" WHERE "order_items"."id" = ?  [["id", 2]]
---
  def destroy
    @order = current_order
    @order_item = @order.order_items.find(params[:id])
    @order_item.destroy