app/controllers/products_controller.rb

SELECT "order_items".* FROM "order_items"  WHERE "order_items"."order_id" = ?  [["order_id", 2]]
---
  def index
    @products = Product.all
    @order_item = current_order.order_items.new

INSERT INTO "products" ("active", "category", "created_at", "manufacturer", "name", "price", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["active", "t"], ["category", "fddgfd"], ["created_at", "2015-04-11 13:34:56.467820"], ["manufacturer", "hytrgdf"], ["name", "fdfd"], ["price", 16.0], ["updated_at", "2015-04-11 13:34:56.467820"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save