app/controllers/reviews_controller.rb

SELECT  "items".* FROM "items"  WHERE "items"."id" = ? LIMIT 1  [["id", 5]]
---
    def item_reviews

    @item = Item.find(params[:id])

SELECT  "restaurants".* FROM "restaurants"  WHERE "restaurants"."id" = ? LIMIT 1  [["id", 20]]
---
  def restaurant_reviews
    # @reviews = Review.where(:restaurant_id => params[:id])

    params[:id].present? ? session[:res_id] = params[:id] : nil

    @restaurant = Restaurant.find(session[:res_id])

INSERT INTO "reviews" ("created_at", "item_id", "rate", "review", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-04-11 14:02:10.555524"], ["item_id", 5], ["rate", 5], ["review", ""], ["updated_at", "2015-04-11 14:02:10.555524"], ["user_id", 16]]
---
  def create
    @review = Review.new(review_params)
    @review.user_id = current_user.id
    @review.save