app/controllers/users_controller.rb

SELECT  "roles".* FROM "roles"  WHERE "roles"."title" = 'user'  ORDER BY "roles"."id" ASC LIMIT 1
INSERT INTO "role_users" ("created_at", "role_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2015-04-09 17:04:05.324638"], ["role_id", 14], ["updated_at", "2015-04-09 17:04:05.324638"], ["user_id", 17]]
INSERT INTO "users" ("created_at", "email", "fname", "gender", "lname", "moneyinfo_id", "number", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "role_users".* FROM "role_users"  WHERE "role_users"."user_id" = ? LIMIT 1  [["user_id", 17]]
---
  def create
    @user = User.new(user_params)
    role = Role.where(:title => "user").first

    respond_to do |format|
      if @user.save
        @user.role = role if role.present?