app/views/reviews/item_reviews.html.erb

SELECT "reviews".* FROM "reviews"  WHERE "reviews"."item_id" = ?  [["item_id", 5]]
---
  <tbody>
  <% if @item.reviews.present? %>